{"meta":{"title":"ocTOPus's Blog","subtitle":"a blog about programming, technology, and other stuff","description":"thanks for visiting my blog!","author":"ocTOPus","url":"https://oc-top-us.github.io","root":"/"},"pages":[],"posts":[{"title":"关于","slug":"about","date":"2024-12-08T05:29:19.476Z","updated":"2024-12-08T05:32:30.763Z","comments":true,"path":"2024/12/08/about/","permalink":"https://oc-top-us.github.io/2024/12/08/about/","excerpt":"","text":"我是谁我是octopus,一名工科学生，欢迎光临我的博客，希望你有美好的一天 博客事件轴 2024年12月8日 博客建立，博客主题借鉴nexmoe和最爱的Cat 一些写给自己的鸡汤Make me thy lyre, even as the forest is:What if my leaves are falling like its own!The tumult of thy mighty harmoniesWill take from both a deep, autumnal tone,Sweet though in sadness. Be thou, Spirit fierce,My spirit! Be thou me, impetuous one!Drive my dead thoughts over the universeLike wither’d leaves to quicken a new birth!And, by the incantation of this verse,Scatter, as from an unextinguish’d hearthAshes and sparks, my words among mankind!Be through my lips to unawaken’d earthThe trumpet of a prophecy! Oh Wind,If Winter comes, can Spring be far behind? 把我当作你的竖琴，当作那树丛：尽管我的叶落了，那有什么关系！你那非凡和谐的慷慨激越之情定能从森林和我同奏出深沉的秋韵，甜美而带苍凉。给我你迅猛的劲头，狂暴的精灵！化成我吧，借你的锋芒！请把我尘封的思想散落在宇宙让它像枯叶一样促成新的生命！哦，请听从这一篇符咒似的诗歌，就把我的心声，像是灰烬和火星从还未熄灭的炉火向人间播散！让预言的喇叭通过我的嘴巴把昏睡的大地唤醒吧！哦，西风啊，如果冬天来了，春天还会远吗？","categories":[],"tags":[]},{"title":"this is too hard","slug":"this-is-too-hard","date":"2024-12-08T04:26:20.000Z","updated":"2024-12-08T04:26:20.845Z","comments":true,"path":"2024/12/08/this-is-too-hard/","permalink":"https://oc-top-us.github.io/2024/12/08/this-is-too-hard/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"test","slug":"test","date":"2024-12-08T04:02:40.000Z","updated":"2024-12-08T04:03:43.585Z","comments":true,"path":"2024/12/08/test/","permalink":"https://oc-top-us.github.io/2024/12/08/test/","excerpt":"","text":"this is a test postsubheading this is the content of the post.this is a bold textthis is an italic textthis is a strikethrough text","categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2024-11-22T13:41:30.868Z","updated":"2024-11-22T13:41:30.868Z","comments":true,"path":"2024/11/22/hello-world/","permalink":"https://oc-top-us.github.io/2024/11/22/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}],"categories":[],"tags":[]}